const yup = require("yup");

exports.schema = yup.object().shape({
    summary: yup
        .string("خلاصه حواله صادر حتمی میباشد!")
        .required("خلاصه حواله صادره حتمی میباشد!")
        .min(2, "خلاصه حواله صادره نباید کمتر از دو حرف باشد!"),
    from: yup
        .string("مبدا حواله صادره حتمی میباشد!")
        .required("مبدا حواله صادره حتمی میباشد!")
        .min(2, "مبدا حواله صادره نباید کمتراز دو حرف باشد!")
        .max(255, "مبدا حواله صادره نباید بشتر از 255 حرف باشد!"),

    to: yup
        .string("مبدا حواله صادره حتمی میباشد!")
        .required("مبدا حواله صادره حتمی میباشد!")
        .min(2, "مبدا حواله صادره نباید کمتراز دو حرف باشد!")
        .max(255, "مبدا حواله صادره نباید بشتر از 255 حرف باشد!"),
    docSequenceNum: yup
        .string()
        .required("نمبر مسلسل حواله صادره حتمی میباشد!")
        .min(1, "نمبر مسلسل حواله صادره نباید کمتر از یک حرف باشد!")
        .max(255, "نمبر مسلسل حواله صادره نباید بشتر از 50 حرف باشد!"),

    docData: yup
        .string("تاریخ  حواله صادره حتمی میباشد!")
        .max(50, "تاریخ حواله صادره نباید بشتر از 50 حرف باشد!"),

    docExportDate: yup
        .string()
        .max(50, "تاریخ صدور حواله صادره نباید بشتر از 50 حرف باشد!"),

    considration: yup
        .string("ملاحضات حواله صادره در حتمی میباشد!")
        .max(255, "آدرس حواله صادره درکتاب نباید بشتر از 255 حرف باشد!"),
});