const yup = require("yup");
// const nameRegex = /^[a-zA-Z0-9]*$/;
// const nameRegex = /^[\u0600-\u06ff]|[\u0750-\u077f]|[\ufb50-\ufc3f]|[\ufe70-\ufefc]*$/;
const nameRegex = /^[\u0600-\u06ff]|[\ufb50-\ufc3f]*$/;

exports.schema = yup.object().shape({
  name: yup
    .string("نام کارمند حتمی میباشد!")
    .matches(nameRegex, "لطفا نام را وارد نماید!")
    .required("نام کارمند حتمی میباشد!")
    .min(3, "نام کارمند حد اقل سه حرف باشد!")
    .max(200, "نام کارمند نباید بیشتر از ۲۰۰ حرف باشد!"),
  fName: yup
    .string("نام پدر کارمند حتمی میباشد!")
    .required("نام پدر کارمند حتمی میباشد!")
    .matches(nameRegex, "لطفا نام پدر را وارد نماید!")
    .min(3, "نام پدر کارمند حد اقل سه حرف باشد!")
    .max(200, "نام پدر کارمند نباید بیشتر از ۲۰۰ حرف باشد!"),
  gFName: yup
    .string("نام پدر کلان کارمند حتمی میباشد!")
    .min(3, "نام پدر کلان کارمند حد اقل سه حرف باشد!")
    .matches(nameRegex, "لطفا نام پدرکلان را وارد نماید!")
    .max(200, "نام پدر کلان کارمند نباید بیشتر از ۲۰۰ حرف باشد!"),
  Job: yup
    .string("رتبه حتمی میباشد!")
    .required("رتبه حتمی میباشد!")
    .matches(nameRegex, "لطفا وظیفه را وارد نماید!")
    .min(3, "رتبه حد اقل سه حرف باشد")
    .max(15, "رتبه نمیتواند بیشتر از 50 حرف داشته باشد!"),
  province: yup
    .string("نام ولایت حتمی میباشد!")
    .required("نام ولایت حتمی میباشد!")
    .matches(nameRegex, "لطفا نام ولایت را وارد نماید!")
    .min(2, "نام ولایت نباید کمتر از 2حرف داشته باشد")
    .max(200, "نام ولایت نباید بیشتر از 50 حرف باشد"),
  destrict: yup
    .string("نام ولسوالی حتمی میباشد!")
    .matches(nameRegex, "لطفا نام والسوالی را وارد نماید!")
    .min(2, "نام ولسوالی نباید کمتر از 3حرف داشته باشد")
    .max(50, "نام ولسوالی نباید بیشتر از ۵۰ حرف باشد"),
  tazkiraNum: yup
    .string("نمبر تذکره حتمی میباشد!")
    .required("نمبر تذکره حتمی میباشد!")
    .min(3, "نمبر تذکره نباید کمتر از سه حرف داشته باشد")
    .max(50, "نمبر تذکره نباید بیشتر از ۵۰ حرف باشد"),

  idCard: yup
    .string("نمبر تذکره حتمی میباشد!")
    .required("نمبر تذکره حتمی میباشد!")
    .min(3, "نمبر تذکره نباید کمتر از 2 حرف داشته باشد")
    .max(50, "نمبر تذکره نباید بیشتر از ۵۰ حرف باشد"),

  phoneNum: yup
    .string("شماره تماس حتمی میباشد!")
    .required("شماره تماس حتمی میباشد!")
    .matches(/^[0-9]*$/, "لطفا شماره تماس را وارد نماید!")
    .min(10, "شماره تماس نباید کمتر از ده عدد داشته باشد")
    .max(15, " شماره تماس نباید بیشتر از ۱۵ عدد باشد"),

});
