const yup = require("yup");

exports.schema = yup.object().shape({
    mattress: yup
        .number()
        .required("مقدار جنس حتمی می باشد!")
        .min(0, "نباید کمتر از صفر باشد!")
        .max(2, "نباید بشتراز عدد 2 باشد!"),
    pillow: yup
        .number()
        .required("مقدار جنس حتمی می باشد!")
        .min(0, "نباید کمتر از صفر باشد!")
        .max(2, "نباید بشتراز عدد 2 باشد!"),
    coverlet: yup
        .number()
        .required("مقدار جنس حتمی می باشد!")
        .min(0, "نباید کمتر از صفر باشد!")
        .max(2, "نباید بشتراز عدد 2 باشد!"),
    quilt: yup
        .number()
        .required("مقدار جنس حتمی می باشد!")
        .min(0, "نباید کمتر از صفر باشد!")
        .max(2, "نباید بشتراز عدد 2 باشد!"),
    bed: yup
        .number()
        .required("مقدار جنس حتمی می باشد!")
        .min(0, "نباید کمتر از صفر باشد!")
        .max(2, "نباید بشتراز عدد 2 باشد!"),
    mirror: yup
        .number()
        .required("مقدار جنس حتمی می باشد!")
        .min(0, "نباید کمتر از صفر باشد!")
        .max(2, "نباید بشتراز عدد 2 باشد!"),
    windowShade: yup
        .number()
        .required("مقدار جنس حتمی می باشد!")
        .min(0, "نباید کمتر از صفر باشد!")
        .max(2, "نباید بشتراز عدد 2 باشد!"),
    carpet: yup
        .number()
        .required("مقدار جنس حتمی می باشد!")
        .min(0, "نباید کمتر از صفر باشد!")
        .max(2, "نباید بشتراز عدد 2 باشد!"),
    table: yup
        .number()
        .required("مقدار جنس حتمی می باشد!")
        .min(0, "نباید کمتر از صفر باشد!")
        .max(2, "نباید بشتراز عدد 2 باشد!"),
    chair: yup
        .number()
        .required("مقدار جنس حتمی می باشد!")
        .min(0, "نباید کمتر از صفر باشد!")
        .max(2, "نباید بشتراز عدد 2 باشد!"),
    // Dates: yup
    //     .number()
    //     .required("سال توضیح البسه حتمی میباشد")
    //     .min(1343, "نباید کمتراز سال 1343 باشد!")
    //     .max(1450, "نباید بشتراز 1450 باشد!")
});