const yup = require("yup");

exports.schema = yup.object().shape({
    docNum: yup  
    .string("نمبر مکتوب حتمی میباشد!")
    .required("نمبر مکتوب حتمی میباشد!")
    .min(2,"نمبرمکتوب نباید کمتر از دو حرف باشد")
    .max(255,"نمبر مکتوب نباید بشتر از 255 حرف باشد!"),


    docTitle: yup  
    .string("عنوان مکتوب حتمی می باشد!")
    .required("عنوان مکتوب حتمی می باشد!")
    .min(2," عنوان مکتوب نباید کمتر از دو حرف باشد")
    .max(255,"عنوان مکتوب نباید بشتر از 255 حرف باشد!"),
  
    docContent: yup
    .string("متن مکتوب (محتوای مکتوب)ضروری می باشد!")
    .required("متن مکتوب (محتوای مکتوب) ضروری می باشد!")
    .min(2," متن مکتوب (محتوای مکتوب) نباید کمتر از دو حرف باشد"),
    docSummary: yup
    .string("خلاصه متن حتمی می باشد!")
    .required("خلاصه متن حتمی می باشد!")
    .min(2,"خلاصه متن نباید کمتر از دو حرف باشد!"),
  
    docDate : yup
    .date()
    .required("تاریخ مکتوب ضروری می باشد!"),
   
    registerDate : yup
    .date()
    .required("تاریخ ثبت مکتوب حتمی می باشد!"),
    
    source : yup
    .string("مکتوب از کدام اداره روان شده(منبع مکتوب) حتمی می باشد!")
    .required("مکتوب از کدام داره روان شده(منبع مکتوب) حتمی می باشد!")
    .min(2,"منبع مکتوب نباید کمتر از دو حرف باشد!"),
  
    
    destination:yup
    .string("مکتوب به کدام اداره روان شده(مصقد) حتمی می باشد!")
    .required("مکتوب به کدام اداره روان شده(مصقد) حتمی می باشد!")
    .min(2,"مقصد مکتوب نباید کمتر در حرف باشد!"),


});
