const yup = require("yup");

exports.schema = yup.object().shape({
    roomNum: yup.mixed().oneOf(
        [
            "1",
            "2",
            "3",
            "4",
            "5",
            "6",
            "7",
            "8",
            "9",
            "10",
            "11",
            "12",
            "13",
            "14",
            "15",
            "16",
            "17",
        ],
        "یکی از اطاق ها را اتنخاب کنید!"
    )
        .required("نمبر اطاق حتمی میباشد!"),

    floorNum: yup
        .mixed().oneOf(
            ["1", "2", "3", "4"],
            "یکی از منزل ها را انتخاب کنید"
        )
        .required("نمبر منزل حتمی می باشد!"),
    blockNum: yup
        .mixed().oneOf(
            ["1", "2", "3", "4"],
            "یکی از بلاک ها را انتخاب کنید!"
        )
        .required("نمبر بلاک حتمی می باشد!"),
});
