const yup = require("yup");

exports.schema = yup.object().shape({

    ingradient: yup
        .string()
        .required("لطفا نام جنس را وارد نمایید!")
        .min(1, "نام جنس نباید کمتر از یک حرف باشد!")
        .max(32, "نام جنس نباید بیشتر از 32 حرف باشد!"),

    // Gram
    morningIngradientAmount: yup
        .number()
        .required("لطفا مقدار استحقاق را وارد نمایید!")
        .positive("استحقاق باید یک عدد مثبت باشد!")
        .min(0, "لطفا عدد بزرگتر از صفر وارد نمایید!")
        .max(1000, "استحقاق نباید بیشتر از 1000 گرام باشد!"),

    noonIngradientAmount: yup
        .number()
        .required("لطفا مقدار استحقاق را وارد نمایید!")
        .min(0, "لطفا عدد بزرگتر از صفر وارد نمایید!")
        .max(1000, "استحقاق نباید بیشتر از 1000 گرام باشد!"),

    nightIngradientAmount: yup
        .number()
        .required("لطفا مقدار استحقاق را وارد نمایید!")
        .min(0, "لطفا عدد بزرگتر از صفر وارد نمایید!")
        .max(1000, "استحقاق نباید بیشتر از 1000 گرام باشد!"),

    calory: yup
        .number()
        .required("لطفا مقدار کالوری را وارد نمایید!")
        .min(0, "لطفا عدد بزرگتر از صفر وارد نمایید!")
        .max(1000, "کالوری نباید بیشتر از 1000 گرام باشد!"),

});